<?xml version="1.0" encoding="UTF-8"?>

<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">

<plist version="1.0">

<dict>

    <key>Description</key>

    <string>Downloads the latest version of Fiji.</string>

    <key>Identifier</key>
    
    <string>com.github.autopkg.download.Fiji</string>

    <key>Input</key>

    <key>MinimumVersion</key>

    <string>0.2.0</string>

    <key>Process</key>

    <array>
        <dict>
            <key>Processor</key>
        <string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://imagej.net/Fiji/Downloads</string>
				<key>re_pattern</key>
				<string>Version (?P&lt;version&gt;[0-9a-z\.]*)</string>
			</dict>

            <key>Processor</key>

            <string>EndOfCheckPhase</string>

        </dict>
       
   </array>
   
</dict>
