<?xml version="1.0" encoding="UTF-8"?>

<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">

<plist version="1.0">

<dict>

    <key>Description</key>

    <string>Downloads the latest version of Fiji.</string>

    <key>Identifier</key>
    
    <string>com.github.autopkg.download.Fiji</string>

    <key>Input</key>

    <dict>

        <key>NAME</key>

        <string>Fiji</string>

        <key>DOWNLOAD_URL</key>
        
        <string>https://downloads.imagej.net/fiji/latest/fiji-macosx.zip</string>

    </dict>

    <key>MinimumVersion</key>

    <string>0.2.0</string>

    <key>Process</key>

    <array>

        <dict>

            <key>Processor</key>

            <string>URLDownloader</string>

            <key>Arguments</key>

            <dict>

                <key>url</key>

                <string>%DOWNLOAD_URL%</string>

                <key>filename</key>

                <string>%NAME%.zip</string>
        </dict>

            </dict>

        <dict>

            <key>Processor</key>

            <string>EndOfCheckPhase</string>

        </dict>
       
   </array>
   
</dict>
