<?xml version="1.0" encoding="UTF-8"?>

<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">

<plist version="1.0">

<dict>

    <key>Description</key>

    <string>Downloads the latest Slack.</string>

    <key>Identifier</key>
    
    <string>com.github.autopkg.download.Slack</string>

    <key>Input</key>

    <dict>

        <key>NAME</key>

        <string>Slack</string>

        <key>DOWNLOAD_URL</key>
        
        <string>https://downloads.slack-edge.com/mac_releases/Slack-3.4.2.dmg</string>

    </dict>

    <key>MinimumVersion</key>

    <string>0.2.0</string>

    <key>Process</key>

    <array>

        <dict>

            <key>Processor</key>

            <string>URLDownloader</string>

            <key>Arguments</key>

            <dict>

                <key>url</key>

                <string>%DOWNLOAD_URL%</string>

                <key>filename</key>

                <string>%NAME%.dmg</string>
        </dict>

            </dict>

        <dict>

            <key>Processor</key>

            <string>EndOfCheckPhase</string>

        </dict>

        <dict>   

            <key>Processor</key>   

            <string>CodeSignatureVerifier</string>   

            <key>Arguments</key>    

            <dict>   

                <key>input_path</key>   

                <string>%pathname%/Slack*.app</string>
                   
                </dict>

            </dict>

    </array>

</dict>

</plist>
